# GetAreaBasedLoadIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalLoadAreaData..::..GetAreaBasedLoadIds Method
ElectricalLoadAreaData Class See Also
---
Gets the area based load ids of the electrical load area to be included.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ISet<ElementId> GetAreaBasedLoadIds()
```

Visual Basic
---
```text
Public Function GetAreaBasedLoadIds As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetAreaBasedLoadIds()
```

# See Also
ElectricalLoadAreaData Class
Autodesk.Revit.DB.Electrical Namespace